# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'sambadevi/powerlevel9k'
tap 'cjbassi/gotop'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'deno'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.4'
brew 'php@7.2'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'vim'

# CLI
brew 'lsd'
brew 'iterm2'
brew 'powerlevel9k'
brew 'gotop'
brew 'neofetch'
brew 'fontforge'
brew 'https://raw.githubusercontent.com/Homebrew/homebrew-core/master/Formula/zsh-autosuggestions.rb'
brew 'https://raw.githubusercontent.com/Homebrew/homebrew-core/master/Formula/zsh-syntax-highlighting.rb'

# Apps
cask '1password'
cask 'aerial'
cask 'alfred'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'postman'
cask 'java'
cask 'mysqlworkbench'
cask 'phpstorm'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'phpstorm'
cask 'tableplus'
cask 'there'
cask 'the-unarchiver'
cask 'brave-browser'
cask 'tor-browser'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'whatsapp'
cask 'zeplin'
cask 'youtube-dl'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas '1Password', id: 1333542190
mas 'spark', id: 1176895641
mas 'TweetDeck', id: 485812721
